IDEA StatiCa Open Model
CrossSectionComponentThermalData.ComponentIndex Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Zero based index of component
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int ComponentIndex { get; set; }
Public Property ComponentIndex As Integer
	Get
	Set
public:
property int ComponentIndex {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
CrossSectionComponentThermalData Class
IdeaRS.OpenModel.CrossSection Namespace